"""Используя программу из задачи 100, запросите у пользователя имя и регион. Выведите соответ-
ствующие данные. Запросите у пользователя имя и регион того значения, которое он хочет изме-
нить, и позвольте скорректировать объем продаж. Выведите объемы продаж по всем регионам для
имени, выбранного пользователем.
"""
sales = {"john": {"N":3056,"S":8463,"W":2694,"E":8441}, 
"Tom": {"N":8754, "S":1234,"W":7834,"E":1565},
"Mary": {"N":8744,"S":9833,"W":33321,"E":12394}}
print(sales)

user_input = input("")